S0DX/esp8266-powerstrip/src/web_config.cpp
#include "web_config.h"
#include "wifi_mgr.h"
#include "gpio_mgr.h"
#include "config.h"
#include "energy_mgr.h"
#include "log_buffer.h"
#include "index_html_gz.h"
#include <sys/time.h>
#include "sy7t609.h"
#include "mqtt_mgr.h"
#include <EEPROM.h>
#include <WiFiClient.h>
#include <ESP8266HTTPUpdateServer.h>
#include <ESP8266httpUpdate.h>
#include <StreamString.h>
#include <DNSServer.h>

std::unique_ptr<ESP8266WebServer> WebConfigServer::server_;
std::unique_ptr<ESP8266HTTPUpdateServer> httpUpdater_;
std::unique_ptr<DNSServer> dnsServer_;
void (*WebConfigServer::save_callback_)(const char*, const char*) = nullptr;

// ===== 崩溃现场捕获（诊断用）=====
// custom_crash_callback 是 core 的 weak 钩子（core_esp8266_postmortem.cpp），
// 异常时在重启前被调用。把 rst_info 寄存器现场和栈顶快照写入 RTC 用户区
// word 24 起（CrashLogRTC 占 word 0-21，测试区 word 100，互不冲突），
// 重启后经 /api/crashdump 读出，用 addr2line 对 firmware.elf 解码定位。
#define CRASH_DUMP_RTC_OFFSET 24
#define CRASH_DUMP_MAGIC      0xD15EA5E5

struct CrashDumpRTC {
    uint32_t magic;
    uint32_t reason;
    uint32_t exccause;
    uint32_t epc1, epc2, epc3;
    uint32_t excvaddr;
    uint32_t depc;
    uint32_t sp;
    uint32_t stack[20];
};

extern "C" void custom_crash_callback(struct rst_info* rst_info, uint32_t stack, uint32_t stack_end) {
    static CrashDumpRTC d;
    d.magic = CRASH_DUMP_MAGIC;
    d.reason = rst_info->reason;
    d.exccause = rst_info->exccause;
    d.epc1 = rst_info->epc1;
    d.epc2 = rst_info->epc2;
    d.epc3 = rst_info->epc3;
    d.excvaddr = rst_info->excvaddr;
    d.depc = rst_info->depc;
    d.sp = stack;
    int n = 0;
    for (uint32_t p = stack; p + 4 <= stack_end && n < 20; p += 4) {
        d.stack[n++] = *(uint32_t*)p;
    }
    for (; n < 20; n++) d.stack[n] = 0;
    ESP.rtcUserMemoryWrite(CRASH_DUMP_RTC_OFFSET, (uint32_t*)&d, sizeof(d));
}

// P0: Web 请求优先级机制
volatile bool WebConfigServer::web_request_active_ = false;
unsigned long WebConfigServer::web_request_start_ = 0;

// /api/status 使用静态缓冲区，避免 1600 字节大数组压在栈上导致栈溢出
static char status_buf[2048];

// 页面发送缓冲：4 对齐 RAM 中转。lwIP precache 对源数据做 word 级访问，
// PROGMEM 奇数基址会触发 EXCCAUSE=3 LoadStoreError 直接崩机（实测
// INDEX_HTML_GZ 基址 0x4025A165），必须先拷入对齐 RAM 再交给 WiFiClient。
static uint8_t page_send_buf[1024] __attribute__((aligned(4)));

// ===== 请求级诊断日志（手机端卡死排查用）=====
// 关键 handler 进出打点，环形缓冲最近 24 条，/api/reqlog 读取。
// tag 约定：pg-in/pg-out=页面 rl-in/rl-out=继电器 st-in/st-out=状态
#define REQ_LOG_N 64
struct ReqLogEntry { uint32_t t; char tag[6]; };
static ReqLogEntry req_log[REQ_LOG_N];
static uint8_t req_log_idx = 0;
static void log_req(const char* tag) {
    strncpy(req_log[req_log_idx].tag, tag, 5);
    req_log[req_log_idx].tag[5] = 0;
    req_log[req_log_idx].t = millis();
    req_log_idx = (uint8_t)((req_log_idx + 1) % REQ_LOG_N);
}

// P0: Web 请求优先级机制实现
bool WebConfigServer::isWebRequestActive() {
    // 超时保护：50ms 后自动清除（防止死锁导致主循环永久跳过 SY7T609 读取）
    if (web_request_active_ && millis() - web_request_start_ > 50) {
        web_request_active_ = false;
    }
    return web_request_active_;
}

void WebConfigServer::markWebRequestStart() {
    web_request_active_ = true;
    web_request_start_ = millis();
}

void WebConfigServer::markWebRequestEnd() {
    web_request_active_ = false;
}

// P0: 关键 API 列表（WiFi 扫描期间仍需响应）
bool WebConfigServer::isCriticalApi(const String& uri) {
    return uri == "/" || uri == "/api/status" || uri == "/api/debug" ||
           uri == "/api/meter" || uri == "/api/relay" ||
           uri.startsWith("/api/connect") || uri == "/api/now";
}


void WebConfigServer::init() {
    server_ = std::make_unique<ESP8266WebServer>(WEB_SERVER_PORT);
    httpUpdater_ = std::make_unique<ESP8266HTTPUpdateServer>();
    dnsServer_ = std::make_unique<DNSServer>();

    httpUpdater_->setup(server_.get(), "/update", "admin", "admin");

    // 启动 DNS 服务器，实现 Captive Portal (强制门户) 拦截所有域名解析请求重定向到 ESP
    dnsServer_->start(53, "*", WiFi.softAPIP());

    server_->on("/", HTTP_GET, []() {
        log_req("pg-in");
        WiFiManager::boostTxPower();  // P1: 页面访问时临时提升功率
        server_->sendHeader("Cache-Control", "no-cache, no-store, must-revalidate");
        server_->sendHeader("Pragma", "no-cache");
        server_->sendHeader("Expires", "-1");
        server_->sendHeader("Content-Encoding", "gzip");
        server_->setContentLength(sizeof(INDEX_HTML_GZ));
        server_->send(200, "text/html; charset=UTF-8", "");
        // 分块可靠发送：每块拷入 4 对齐 RAM 缓冲规避 lwIP 奇地址 word 访问崩溃，
        // 按 write 返回值续传（每块独立超时窗口）解决弱信号下短写截断。
        {
            const size_t total = sizeof(INDEX_HTML_GZ);
            const uint32_t deadline = millis() + 30000;
            size_t sent = 0;
            uint8_t failures = 0;
            while (sent < total && failures < 3 && millis() < deadline) {
                size_t chunk = total - sent > sizeof(page_send_buf) ? sizeof(page_send_buf) : total - sent;
                memcpy_P(page_send_buf, (const uint8_t*)INDEX_HTML_GZ + sent, chunk);
                size_t n = server_->client().write(page_send_buf, chunk);
                if (n == 0) {
                    if (++failures >= 3) break;
                    delay(1);
                    continue;
                }
                failures = 0;
                sent += n;
                yield();
            }
            log_req("pg-out");
        }
        delay(1);
    });

    // iOS Captive Portal 检测端点：返回 200 HTML 页面并自动跳转到配置页。
    // 若返回 "Success" 或 302 重定向，iOS 某些版本会判定已联网而不弹出门户。
    server_->on("/hotspot-detect.html", HTTP_GET, []() {
        server_->sendHeader("Cache-Control", "no-cache, no-store, must-revalidate");
        server_->sendHeader("Pragma", "no-cache");
        server_->sendHeader("Expires", "-1");
        String portalUrl = String("http://") + WiFi.softAPIP().toString() + "/";
        String html = "<!DOCTYPE html><html><head><meta charset='UTF-8'>";
        html += "<meta http-equiv='refresh' content='0; url=" + portalUrl + "'>";
        html += "<title>WiFi 配置</title></head><body>";
        html += "<p style='font-family:-apple-system,sans-serif;text-align:center;padding-top:40px'>";
        html += "请打开 <a href='" + portalUrl + "'>配置页面</a>";
        html += "</p></body></html>";
        server_->send(200, "text/html; charset=UTF-8", html);
    });

    // Android Captive Portal 检测：期望 204，返回 302 让 Android 判定为门户并弹窗
    // 覆盖 clients3.google.com / connectivitycheck.gstatic.com 等变体的探测路径
    server_->on("/generate_204", HTTP_GET, []() {
        String portalUrl = String("http://") + WiFi.softAPIP().toString() + "/";
        server_->sendHeader("Location", portalUrl, true);
        server_->send(302, "text/plain", "");
    });
    server_->on("/gen_204", HTTP_GET, []() {
        String portalUrl = String("http://") + WiFi.softAPIP().toString() + "/";
        server_->sendHeader("Location", portalUrl, true);
        server_->send(302, "text/plain", "");
    });

    // Windows Captive Portal 检测：msftconnecttest.com/connecttest.txt 与 /redirect
    server_->on("/connecttest.txt", HTTP_GET, []() {
        String portalUrl = String("http://") + WiFi.softAPIP().toString() + "/";
        server_->sendHeader("Location", portalUrl, true);
        server_->send(302, "text/plain", "");
    });
    server_->on("/redirect", HTTP_GET, []() {
        String portalUrl = String("http://") + WiFi.softAPIP().toString() + "/";
        server_->sendHeader("Location", portalUrl, true);
        server_->send(302, "text/plain", "");
    });

    server_->on("/api/status", HTTP_GET, []() {
        log_req("st-in");
        WiFiManager::boostTxPower();  // P1: 状态查询时临时提升功率
        String ip = (WiFi.status() == WL_CONNECTED) ? WiFi.localIP().toString() : WiFi.softAPIP().toString();
        uint8_t sh, sm, eh, em;
        GPIOManager::getCycleTime(sh, sm, eh, em);
        MQTTConfig mq = MQTTManager::getConfig();
        String apPass = WiFiManager::getAPPassword();

        time_t nowTs = time(nullptr);
        struct tm* tinfo = localtime(&nowTs);
        bool timeValid = (tinfo && tinfo->tm_year > 100);
        int curMins = timeValid ? (tinfo->tm_hour * 60 + tinfo->tm_min) : -1;

        snprintf(status_buf, sizeof(status_buf),
            "{\"conn\":%s,\"ip\":\"%s\",\"ssid\":\"%s\",\"rssi\":%d,"
            "\"ver\":\"%s\",\"up\":%lu,\"m\":%s,\"s\":%s,"
            "\"lk\":%s,\"te\":%s,\"tr\":%s,\"td\":%d,\"tl\":%lu,"
            "\"v\":%.1f,\"i\":%.3f,\"p\":%.2f,\"e\":%.2f,\"me\":%s,\"rl\":%s,"
            "\"ce\":%s,\"sh\":%d,\"sm\":%d,\"eh\":%d,\"em\":%d,\"cpc\":%d,\"ca\":%s,\"tv\":%s,\"cm\":%d,"
            "\"pe\":%s,\"pt\":%.2f,"
            "\"be\":%s,\"bt\":%.2f,\"bm\":%.2f,\"btt\":%d,\"bmo\":%d,\"bu\":%.2f,\"bum\":%.2f,\"but\":%u,\"bsr\":%d,\"ep\":%.2f,\"mo\":%.2f,\"lm\":%.2f,"
            "\"de\":%s,\"dt\":\"%s\",\"dl\":%s,\"dr\":%d,\"dm\":\"%s\",\"dp\":%s,\"pc\":%s,\"ds\":%d,\"ts\":%d,\"om\":%s,\"bd\":%s,"
            "\"mqe\":%s,\"mqs\":\"%s\",\"mqp\":%d,\"mqu\":\"%s\",\"mqpw\":\"%s\","
            "\"ap\":\"%s\",\"aps\":\"%s\",\"host\":\"%s\",\"cv\":%d,\"bat\":%s,\"acap\":%s,\"wtpl\":%s,\"syslog\":%s,\"rst\":\"%s\"}",
            WiFiManager::isConnected() ? "true" : "false",
            ip.c_str(),
            WiFiManager::getCurrentSSID().c_str(),
            WiFiManager::getCurrentRSSI(),
            VERSION,
            millis() / 1000,
            GPIOManager::getRelayMaster() ? "true" : "false",
            GPIOManager::getRelaySlave() ? "true" : "false",
            GPIOManager::isLocked() ? "true" : "false",
            GPIOManager::isTimerEnabled() ? "true" : "false",
            GPIOManager::isTimerRunning() ? "true" : "false",
            GPIOManager::getTimerDuration(),
            GPIOManager::getTimerRemaining(),
            SY7T609::getVoltage(),
            SY7T609::getCurrent(),
            SY7T609::getPower(),
            EnergyManager::getTotalEnergy(),
            SY7T609::isEnabled() ? "true" : "false",
            GPIOManager::isRedLedEnabled() ? "true" : "false",
            GPIOManager::isCycleEnabled() ? "true" : "false",
            sh, sm, eh, em, GPIOManager::getCyclePeriodCount(),
            GPIOManager::isCycleActive() ? "true" : "false",
            timeValid ? "true" : "false",
            curMins,
            GPIOManager::isPowerOffEnabled() ? "true" : "false",
            GPIOManager::getPowerOffThreshold(),
            GPIOManager::isBillingEnabled() ? "true" : "false",
            GPIOManager::getBillingThreshold(),
            GPIOManager::getBillingThresholdMoney(),
            GPIOManager::getBillingThresholdTime(),
            (int)GPIOManager::getBillingMode(),
            GPIOManager::getBillingUsedEnergy() / 1000.0f,
            GPIOManager::getBillingUsedMoney(),
            GPIOManager::getBillingUsedMinutes(),
            (int)GPIOManager::getBillingStopReason(),
            GPIOManager::getEnergyPrice(),
            EnergyManager::getMonthlyEnergy() / 1000.0f,
            EnergyManager::getLastMonthEnergy() / 1000.0f,
            GPIOManager::isWiFiDetectEnabled() ? "true" : "false",
            GPIOManager::getWiFiDetectTarget().c_str(),
            GPIOManager::isWiFiDetectLinkTimer() ? "true" : "false",
            GPIOManager::getWiFiDetectRssiThreshold(),
            GPIOManager::getWiFiDetectMac().c_str(),
            GPIOManager::isWiFiDetectPresent() ? "true" : "false",
            GPIOManager::isWiFiDetectPowerChecking() ? "true" : "false",
            GPIOManager::getWiFiDetectScanSpeed(),
            GPIOManager::getTimerSource(),
            GPIOManager::getWiFiDetectRelayOnlyMaster() ? "true" : "false",
            GPIOManager::isButtonDetectEnabled() ? "true" : "false",
            mq.enabled ? "true" : "false",
            mq.server,
            mq.port,
            mq.username,
            mq.password,
            apPass.c_str(),
            WiFiManager::getAPSuffix().c_str(),
            WiFiManager::getHostname().c_str(),
            EEPROM.read(EEPROM_CARD_VISIBILITY_ADDR),
            GPIOManager::isButtonAutoTimerEnabled() ? "true" : "false",
            WiFiManager::isAutoCloseAPEnabled() ? "true" : "false",
            WiFiManager::isWiFiTxPowerLimited() ? "true" : "false",
            log_buffer_is_enabled() ? "true" : "false",
            ESP.getResetReason().c_str()
        );
        int len = strlen(status_buf);
        uint8_t cpCount = GPIOManager::getCyclePeriodCount();
        if (len > 0 && status_buf[len-1] == '}') {
            status_buf[--len] = '\0';
            len += snprintf(status_buf + len, sizeof(status_buf) - len, ",\"cp\":[");
            for (uint8_t i = 0; i < cpCount && len < (int)sizeof(status_buf) - 40; i++) {
                uint8_t psh,psm,peh,pem;
                if (GPIOManager::getCyclePeriod(i, psh, psm, peh, pem)) {
                    if (i > 0 && len < (int)sizeof(status_buf) - 1) status_buf[len++] = ',';
                    len += snprintf(status_buf + len, sizeof(status_buf) - len,
                        "{\"sh\":%d,\"sm\":%d,\"eh\":%d,\"em\":%d}", psh, psm, peh, pem);
                }
            }
            if (len < (int)sizeof(status_buf) - 20) {
                len += snprintf(status_buf + len, sizeof(status_buf) - len, "],\"card_order\":[");
                for (uint8_t i = 0; i < 6 && len < (int)sizeof(status_buf) - 10; i++) {
                    if (i > 0 && len < (int)sizeof(status_buf) - 1) status_buf[len++] = ',';
                    uint8_t v = EEPROM.read(EEPROM_CARD_ORDER_ADDR + i);
                    if (v > 5) v = i;
                    len += snprintf(status_buf + len, sizeof(status_buf) - len, "%d", v);
                }
                if (len < (int)sizeof(status_buf) - 2) {
                    len += snprintf(status_buf + len, sizeof(status_buf) - len, "]}");
                }
            }
        }
        server_->send(200, "application/json", status_buf);
        log_req("st-out");
    });


    // Debug API for SY7T609
    server_->on("/api/debug", HTTP_GET, []() {
        String json = "{\"log\":";
        json += "\"" + SY7T609::getDebugLog() + "\"";
        json += ",\"meterEnabled\":" + String(SY7T609::isEnabled() ? "true" : "false");
        json += ",\"meterReady\":" + String(SY7T609::isReady() ? "true" : "false");
        json += ",\"flashMode\":" + String(SY7T609::isFlashMode() ? "true" : "false");
        json += "}";
        server_->send(200, "application/json", json);
    });

    server_->on("/api/cleardebug", HTTP_POST, []() {
        SY7T609::clearDebugLog();
        server_->send(200, "application/json", "{\"ok\":true}");
    });

    server_->on("/api/relay", HTTP_GET, []() {
        log_req("rl-in");
        String w = server_->arg("w");
        if (w == "m") {
            bool newState = !GPIOManager::getRelayMaster();
            GPIOManager::setRelayMaster(newState);
            // 关闭主继电器时，同时关闭从继电器
            if (!newState) {
                GPIOManager::setRelaySlave(false);
            }
        } else if (w == "s") {
            bool newState = !GPIOManager::getRelaySlave();
            GPIOManager::setRelaySlave(newState);
            // 开启从继电器时，同时开启主继电器
            if (newState) {
                GPIOManager::setRelayMaster(true);
            }
        }
        String response = "{\"m\":" + String(GPIOManager::getRelayMaster() ? "true" : "false") +
                          ",\"s\":" + String(GPIOManager::getRelaySlave() ? "true" : "false") + "}";
        server_->send(200, "application/json", response);
        log_req("rl-out");
    });

