S0DX/esp8266-powerstrip/src/web_config.cpp
    server_->on("/api/card_visibility", HTTP_POST, []() {
        String body = server_->arg("plain");
        int s = body.indexOf(':'), e = body.indexOf('}');
        if (s >= 0 && e > s) {
            String val = body.substring(s + 1, e);
            val.trim();
            uint8_t v = (uint8_t)val.toInt();
            EEPROM.write(EEPROM_CARD_VISIBILITY_ADDR, v);
            EEPROM.commit();
        }
        server_->send(200, "application/json", "{\"ok\":true}");
    });

    server_->on("/api/button_auto_timer", HTTP_GET, []() {
        String enabled = server_->arg("enabled");
        GPIOManager::setButtonAutoTimerEnabled(enabled == "true");
        server_->send(200, "application/json", "{\"ok\":true}");
    });

    server_->on("/api/ap_suffix", HTTP_GET, []() {
        uint8_t v = EEPROM.read(EEPROM_AP_SUFFIX_ADDR);
        server_->send(200, "application/json", "{\"suffix\":" + String(v) + "}");
    });

    server_->on("/api/ap_suffix", HTTP_POST, []() {
        String body = server_->arg("plain");
        int s=body.indexOf(':'), e=body.indexOf('}');
        if(s>=0 && e>s){
            String val = body.substring(s+1, e);
            val.trim();
            int v = val.toInt();
            if (v < 0) v = 0;
            if (v > 255) v = 255;
            EEPROM.write(EEPROM_AP_SUFFIX_ADDR, v);
            EEPROM.commit();
            WiFiManager::setAPSuffix(String(v).c_str());
        }
        server_->send(200, "application/json", "{\"ok\":true}");
    });

    server_->on("/api/hostname", HTTP_GET, []() {
        String json = "{\"hostname\":\"" + WiFiManager::getHostname() + "\"}";
        server_->send(200, "application/json", json);
    });

    server_->on("/api/hostname", HTTP_POST, []() {
        String body = server_->arg("plain");
        String hostname;
        int idx = body.indexOf("\"hostname\"");
        if (idx >= 0) {
            int colon = body.indexOf(':', idx);
            int q1 = body.indexOf('\"', colon);
            int q2 = body.indexOf('\"', q1 + 1);
            if (q1 >= 0 && q2 > q1) {
                hostname = body.substring(q1 + 1, q2);
            }
        }
        hostname.trim();
        hostname.toLowerCase();
        if (WiFiManager::setHostname(hostname.c_str())) {
            server_->send(200, "application/json", "{\"ok\":true}");
        } else {
            server_->send(400, "application/json", "{\"ok\":false,\"error\":\"invalid hostname\"}");
        }
    });

    static bool connect_pending_ = false;
    static String connect_ssid_;
    static bool connect_was_wifi_detect_ = false;
    static unsigned long connect_start_ = 0;

    server_->on("/api/connect", HTTP_POST, []() {
        String ssid = server_->arg("ssid");
        String password = server_->arg("password");

        if (ssid.length() == 0) {
            server_->send(400, "application/json", "{\"ok\":false,\"error\":\"SSID不能为空\"}");
            return;
        }

        connect_pending_ = true;
        connect_ssid_ = ssid;
        connect_was_wifi_detect_ = GPIOManager::isWiFiDetectEnabled();
        connect_start_ = millis();

        if (connect_was_wifi_detect_) {
            GPIOManager::setWiFiDetectEnabled(false);
        }

        WiFiManager::saveConfig(ssid.c_str(), password.c_str());
        server_->send(200, "application/json", "{\"ok\":true,\"status\":\"connecting\"}");
    });

    server_->on("/api/connect_status", HTTP_GET, []() {
        if (!connect_pending_) {
            server_->send(200, "application/json", "{\"status\":\"idle\"}");
            return;
        }

        if (WiFi.status() == WL_CONNECTED) {
            connect_pending_ = false;
            if (connect_was_wifi_detect_) {
                GPIOManager::setWiFiDetectEnabled(true);
            }
            server_->send(200, "application/json", "{\"ok\":true,\"status\":\"connected\",\"ssid\":\"" + connect_ssid_ + "\",\"ip\":\"" + WiFi.localIP().toString() + "\"}");
        } else if (millis() - connect_start_ > 15000) {
            connect_pending_ = false;
            if (connect_was_wifi_detect_) {
                GPIOManager::setWiFiDetectEnabled(true);
            }
            WiFi.disconnect();
            server_->send(200, "application/json", "{\"ok\":false,\"status\":\"failed\",\"error\":\"连接失败，请检查密码\"}");
        } else {
            server_->send(200, "application/json", "{\"status\":\"connecting\",\"elapsed\":" + String(millis() - connect_start_) + "}");
        }
    });

    server_->on("/api/settings", HTTP_GET, []() {
        String redLed = server_->arg("redLed");
        if (redLed == "toggle") {
            GPIOManager::setRedLedEnabled(!GPIOManager::isRedLedEnabled());
        }
        String response = "{\"redLed\":" + String(GPIOManager::isRedLedEnabled() ? "true" : "false") + "}";
        server_->send(200, "application/json", response);
    });

    server_->on("/api/ap_pass", HTTP_POST, []() {
        String pass = server_->arg("pass");
        WiFiManager::saveAPPassword(pass.c_str());
        server_->send(200, "application/json", "{\"ok\":true}");
    });

    // STA 连接后自动关闭 AP 开关
    server_->on("/api/auto_close_ap", HTTP_GET, []() {
        server_->send(200, "application/json",
            String("{\"enabled\":") + (WiFiManager::isAutoCloseAPEnabled() ? "true" : "false") + "}");
    });

    server_->on("/api/auto_close_ap", HTTP_POST, []() {
        if (!server_->hasArg("plain")) {
            server_->send(400, "application/json", "{\"ok\":false}");
            return;
        }
        String body = server_->arg("plain");
        bool enabled = (body.indexOf("\"enabled\":true") >= 0) || (body.indexOf("\"enabled\":1") >= 0);
        WiFiManager::setAutoCloseAP(enabled);
        server_->send(200, "application/json",
            String("{\"ok\":true,\"enabled\":") + (enabled ? "true" : "false") + "}");
    });

    // WiFi 发射功率限制开关
    server_->on("/api/wifi_tx_power", HTTP_GET, []() {
        server_->send(200, "application/json",
            String("{\"enabled\":") + (WiFiManager::isWiFiTxPowerLimited() ? "true" : "false") + "}");
    });

    server_->on("/api/wifi_tx_power", HTTP_POST, []() {
        if (!server_->hasArg("plain")) {
            server_->send(400, "application/json", "{\"ok\":false}");
            return;
        }
        String body = server_->arg("plain");
        bool enabled = (body.indexOf("\"enabled\":true") >= 0) || (body.indexOf("\"enabled\":1") >= 0);
        WiFiManager::setWiFiTxPowerLimited(enabled);
        server_->send(200, "application/json",
            String("{\"ok\":true,\"enabled\":") + (enabled ? "true" : "false") + "}");
    });

    // 系统日志开关
    server_->on("/api/sys_log", HTTP_GET, []() {
        server_->send(200, "application/json",
            String("{\"enabled\":") + (log_buffer_is_enabled() ? "true" : "false") + "}");
    });

    server_->on("/api/sys_log", HTTP_POST, []() {
        if (!server_->hasArg("plain")) {
            server_->send(400, "application/json", "{\"ok\":false}");
            return;
        }
        String body = server_->arg("plain");
        bool enabled = (body.indexOf("\"enabled\":true") >= 0) || (body.indexOf("\"enabled\":1") >= 0);
        log_buffer_set_enabled(enabled);
        server_->send(200, "application/json",
            String("{\"ok\":true,\"enabled\":") + (enabled ? "true" : "false") + "}");
    });

    server_->on("/api/restart", HTTP_POST, []() {
        server_->send(200, "application/json", "{\"ok\":true}");
        delay(100);
        ESP.restart();
    });

    server_->on("/api/reset", HTTP_POST, []() {
        for (int i = 0; i < 1024; i++) {
            if (i == EEPROM_SY7T609_ENABLED_ADDR) {
                EEPROM.write(i, 1); // 电量检测默认开启
            } else {
                EEPROM.write(i, 0);
            }
        }
        EEPROM.commit();
        // 重新初始化默认配置，确保各模块状态一致
        GPIOManager::reset();
        WiFiManager::reset();
        EnergyManager::reset();
        server_->send(200, "application/json", "{\"ok\":true}");
        delay(100);
        ESP.restart();
    });

    server_->on("/api/log", HTTP_GET, []() {
        String json = "[";
        int count = log_buffer_count();
        for (int i = 0; i < count; i++) {
            if (i > 0) json += ",";
            json += "\"";
            const char* line = log_buffer_get_line(i);
            for (int j = 0; line[j]; j++) {
                char c = line[j];
                if (c == '"' || c == '\\') json += '\\';
                if (c == '\n') {
                    json += "\\n";
                } else if (c == '\r') {
                    json += "\\r";
                } else if ((unsigned char)c >= 32 && (unsigned char)c <= 126) {
                    json += c;
                } else {
                    json += '?';
                }
            }
            json += "\"";
        }
        json += "]";
        server_->send(200, "application/json", json);
    });

