S0DX/esp8266-powerstrip/src/web_config.cpp
    server_->on("/api/billing", HTTP_GET, []() {
        if (server_->hasArg("enabled")) {
            bool en = (server_->arg("enabled") == "true");
            GPIOManager::setBillingEnabled(en);
        }
        if (server_->hasArg("threshold")) {
            float th = server_->arg("threshold").toFloat();
            GPIOManager::setBillingThreshold(th);
        }
        if (server_->hasArg("money")) {
            float money = server_->arg("money").toFloat();
            GPIOManager::setBillingThresholdMoney(money);
        }
        if (server_->hasArg("time")) {
            int minutes = server_->arg("time").toInt();
            GPIOManager::setBillingThresholdTime((uint16_t)minutes);
        }
        if (server_->hasArg("mode")) {
            int mode = server_->arg("mode").toInt();
            if (mode >= 0 && mode <= 2) {
                GPIOManager::setBillingMode((GPIOManager::BillingMode)mode);
            }
        }
        char buf[256];
        snprintf(buf, sizeof(buf),
            "{\"enabled\":%s,\"mode\":%d,\"threshold\":%.2f,\"money\":%.2f,\"time\":%d,\"used\":%.2f,\"usedMoney\":%.2f,\"usedTime\":%u,\"stopReason\":%d,\"startEnergy\":%.2f,\"price\":%.2f}",
            GPIOManager::isBillingEnabled() ? "true" : "false",
            (int)GPIOManager::getBillingMode(),
            GPIOManager::getBillingThreshold(),
            GPIOManager::getBillingThresholdMoney(),
            GPIOManager::getBillingThresholdTime(),
            GPIOManager::getBillingUsedEnergy() / 1000.0f,
            GPIOManager::getBillingUsedMoney(),
            GPIOManager::getBillingUsedMinutes(),
            (int)GPIOManager::getBillingStopReason(),
            GPIOManager::getBillingStartEnergy() / 1000.0f,
            GPIOManager::getEnergyPrice());
        server_->send(200, "application/json", buf);
    });

    server_->on("/api/billing", HTTP_POST, []() {
        if (server_->hasArg("price")) {
            float price = server_->arg("price").toFloat();
            if (price > 0 && price < 10) {
                GPIOManager::setEnergyPrice(price);
            }
        }
        if (server_->hasArg("mode")) {
            int mode = server_->arg("mode").toInt();
            if (mode >= 0 && mode <= 2) {
                GPIOManager::setBillingMode((GPIOManager::BillingMode)mode);
            }
        }
        if (server_->hasArg("money")) {
            float money = server_->arg("money").toFloat();
            GPIOManager::setBillingThresholdMoney(money);
        }
        if (server_->hasArg("time")) {
            int minutes = server_->arg("time").toInt();
            GPIOManager::setBillingThresholdTime((uint16_t)minutes);
        }
        if (server_->hasArg("threshold")) {
            float th = server_->arg("threshold").toFloat();
            GPIOManager::setBillingThreshold(th);
        }
        server_->send(200, "application/json", "{\"ok\":true}");
    });

    server_->on("/api/billing/history", HTTP_GET, []() {
        String json = "{\"ok\":true,\"history\":[";
        uint8_t count = GPIOManager::getBillingHistoryCount();
        for (uint8_t i = 0; i < count; i++) {
            GPIOManager::BillingRecord rec = GPIOManager::getBillingHistory(i);
            char item[128];
            snprintf(item, sizeof(item),
                "{\"startTime\":%u,\"usedEnergy\":%.2f,\"cost\":%.2f}%s",
                rec.startTime, rec.usedEnergyWh, rec.costCents / 100.0f,
                (i < count - 1) ? "," : "");
            json += item;
        }
        json += "]}";
        server_->send(200, "application/json", json);
    });

    server_->on("/api/time", HTTP_GET, []() {
        if (server_->hasArg("ts")) {
            time_t ts = server_->arg("ts").toInt();
            struct timeval tv = { .tv_sec = ts, .tv_usec = 0 };
            settimeofday(&tv, NULL);
            configTime(8 * 3600, 0, "pool.ntp.org", "time.nist.gov");
        }
        server_->send(200, "text/plain", "OK");
    });

    server_->on("/api/now", HTTP_GET, []() {
        time_t now = time(nullptr);
        struct tm* timeinfo = localtime(&now);
        char buf[64];
        if (timeinfo && timeinfo->tm_year >= 100) {
            snprintf(buf, sizeof(buf), "{\"ok\":true,\"hour\":%d,\"min\":%02d,\"str\":\"%02d:%02d\"}",
                timeinfo->tm_hour, timeinfo->tm_min,
                timeinfo->tm_hour, timeinfo->tm_min);
        } else {
            snprintf(buf, sizeof(buf), "{\"ok\":false,\"str\":\"--:--\"}");
        }
        server_->send(200, "application/json", buf);
    });

    server_->on("/api/wifidetect", HTTP_GET, []() {
        if (server_->hasArg("enabled")) {
            GPIOManager::setWiFiDetectEnabled(server_->arg("enabled") == "true");
        }
        if (server_->hasArg("target")) {
            GPIOManager::setWiFiDetectTarget(server_->arg("target").c_str());
        }
        if (server_->hasArg("timeout")) {
            GPIOManager::setWiFiDetectTimeout(server_->arg("timeout").toInt());
        }
        if (server_->hasArg("linkTimer")) {
            GPIOManager::setWiFiDetectLinkTimer(server_->arg("linkTimer") == "true");
        }
        if (server_->hasArg("rssi")) {
            GPIOManager::setWiFiDetectRssiThreshold(server_->arg("rssi").toInt());
        }
        if (server_->hasArg("scanSpeed")) {
            GPIOManager::setWiFiDetectScanSpeed((uint8_t)server_->arg("scanSpeed").toInt());
        }
        if (server_->hasArg("onlyMaster")) {
            GPIOManager::setWiFiDetectRelayOnlyMaster(server_->arg("onlyMaster") == "true");
        }
        char buf[256];
        snprintf(buf, sizeof(buf), "{\"enabled\":%s,\"target\":\"%s\",\"timeout\":%d,\"linkTimer\":%s,\"rssi\":%d,\"scanSpeed\":%d,\"mac\":\"%s\",\"present\":%s,\"powerCheck\":%s,\"onlyMaster\":%s}",
            GPIOManager::isWiFiDetectEnabled() ? "true" : "false",
            GPIOManager::getWiFiDetectTarget().c_str(),
            GPIOManager::getWiFiDetectTimeout(),
            GPIOManager::isWiFiDetectLinkTimer() ? "true" : "false",
            GPIOManager::getWiFiDetectRssiThreshold(),
            GPIOManager::getWiFiDetectScanSpeed(),
            GPIOManager::getWiFiDetectMac().c_str(),
            GPIOManager::isWiFiDetectPresent() ? "true" : "false",
            GPIOManager::isWiFiDetectPowerChecking() ? "true" : "false",
            GPIOManager::getWiFiDetectRelayOnlyMaster() ? "true" : "false");
        server_->send(200, "application/json", buf);
    });

    server_->on("/api/button_detect", HTTP_GET, []() {
        if (server_->hasArg("enabled")) {
            GPIOManager::setButtonDetectEnabled(server_->arg("enabled") == "true");
        }
        char buf[64];
        snprintf(buf, sizeof(buf), "{\"enabled\":%s}",
            GPIOManager::isButtonDetectEnabled() ? "true" : "false");
        server_->send(200, "application/json", buf);
    });

