S0DX/esp8266-powerstrip/src/web_config.cpp
    // 扫描 WiFi 网络（改为异步扫描并在等待期间喂狗，避免同步阻塞触发 Hardware Watchdog）
    server_->on("/api/scan", HTTP_GET, []() {
        int8_t scanStatus = WiFi.scanComplete();
        if (scanStatus == WIFI_SCAN_RUNNING) {
            // 已有扫描在运行，等待其完成
            unsigned long scanStart = millis();
            while (WiFi.scanComplete() == WIFI_SCAN_RUNNING) {
                yield();
                ESP.wdtFeed();
                if (millis() - scanStart > 10000) {
                    server_->send(200, "application/json", "[]");
                    return;
                }
            }
            scanStatus = WiFi.scanComplete();
        } else if (scanStatus < 0) {
            // 启动新异步扫描
            WiFi.scanNetworks(true, true);
            unsigned long scanStart = millis();
            while (WiFi.scanComplete() == WIFI_SCAN_RUNNING) {
                yield();
                ESP.wdtFeed();
                if (millis() - scanStart > 10000) {
                    WiFi.scanDelete();
                    server_->send(200, "application/json", "[]");
                    return;
                }
            }
            scanStatus = WiFi.scanComplete();
        }

        if (scanStatus < 0) {
            WiFi.scanDelete();
            server_->send(200, "application/json", "[]");
            return;
        }

        int n = scanStatus;
        struct WiFiAP { String ssid; int rssi; bool enc; };
        WiFiAP aps[32];
        int apCount = 0;
        for (int i = 0; i < n && apCount < 32; i++) {
            String ssid = WiFi.SSID(i);
            int rssi = WiFi.RSSI(i);
            bool enc = (WiFi.encryptionType(i) != ENC_TYPE_NONE);
            bool found = false;
            for (int j = 0; j < apCount; j++) {
                if (aps[j].ssid == ssid) {
                    found = true;
                    if (rssi > aps[j].rssi) {
                        aps[j].rssi = rssi;
                        aps[j].enc = enc;
                    }
                    break;
                }
            }
            if (!found) {
                aps[apCount++] = {ssid, rssi, enc};
            }
        }
        String json = "[";
        for (int i = 0; i < apCount; i++) {
            if (i > 0) json += ",";
            json += "{\"ssid\":\"" + aps[i].ssid + "\",\"rssi\":" + aps[i].rssi + ",\"enc\":" + (aps[i].enc ? "true" : "false") + "}";
        }
        json += "]";
        WiFi.scanDelete();
        server_->send(200, "application/json", json);
    });

    server_->on("/api/reset_energy", HTTP_POST, []() {
        EnergyManager::reset();
        // 计费会话和历史记录同时清零
        GPIOManager::setBillingStartEnergy(0);
        EEPROM.write(EEPROM_BILLING_HISTORY_COUNT_ADDR, 0);
        for (int i = 0; i < EEPROM_BILLING_HISTORY_MAX * EEPROM_BILLING_RECORD_SIZE; i++) {
            EEPROM.write(EEPROM_BILLING_HISTORY_ADDR + i, 0);
        }
        EEPROM.commit();
        server_->send(200, "application/json", "{\"ok\":true}");
    });

    server_->onNotFound([]() {
        // Captive Portal：AP 模式下所有未匹配请求重定向到配置页。
        // 使用 AP IP 而非 .local 主机名，避免 iOS 某些版本因 mDNS 解析未完成而无法弹出门户。
        String host = WiFiManager::getMDNSHostname();
        if (host.length() == 0) host = "power";
        IPAddress apIP = WiFi.softAPIP();
        String portalUrl;
        if (apIP[0] != 0) {
            portalUrl = String("http://") + apIP.toString() + "/";
        } else {
            portalUrl = String("http://") + host + ".local/";
        }
        server_->sendHeader("Location", portalUrl, true);
        server_->send(302, "text/plain", "");
    });

    server_->begin();
    DBG_PRINTF("[Web] Server started on port %d\n", WEB_SERVER_PORT);
    DBG_PRINTF("[OTA] Update endpoint: /update (user:admin pass:admin)\n");
}

void WebConfigServer::handle() {
    // 每次循环处理多个 DNS/Web 请求，降低高并发或慢客户端场景下的超时概率
    if (dnsServer_) {
        for (int i = 0; i < 4; i++) {
            dnsServer_->processNextRequest();
        }
    }
    WiFiManager::updateMDNS();  // Web 请求前让 mDNS 有机会响应查询
    // P0: 标记 Web 请求处理中，主循环检测到此标志时跳过 SY7T609 读取等阻塞操作
    // 50ms 超时保护（在 isWebRequestActive 中实现）防止死锁
    markWebRequestStart();
    for (int i = 0; i < 2; i++) {
        server_->handleClient();
    }
    markWebRequestEnd();
    WiFiManager::updateMDNS();  // Web 请求后再次响应，避免长请求期间 mDNS 查询超时
}

void WebConfigServer::setSaveCallback(void (*callback)(const char*, const char*)) {
    save_callback_ = callback;
}